#!/bin/bash

#echo -e "\e[1;32m
# =====================================================
# =====================================================
#                Подключение к WiFi
# =====================================================
# =====================================================
#\e[0m"
# nmcli device wifi list
# nmcli device wifi connect PDA password plaksina48
# nmcli connection show
# nmcli connection delete PDA

echo -e "\e[1;32m
=======================================================
=======================================================
             Установка основных пакетов
=======================================================
=======================================================
\e[0m"
sudo pacman -S git waybar hyprpaper hyprlock thunar meson flatpack fastfetch --noconfirm

echo -e "\e[1;32m
=======================================================
=======================================================
                  Установка шрифтов
=======================================================
=======================================================
\e[0m"
sudo pacman -S ttf-font-awesome otf-font-awesome ttf-jetbrains-mono --noconfirm

echo -e "\e[1;32m
=======================================================
=======================================================
                Копирование конфигов
=======================================================
=======================================================
\e[0m"
git clone https://github.com/Trebein/HyprArch
конфиг хупрлэнд
конфиг хупрпапер
обоина
конфиг хупрлок
конфиг вэйбар
конфиг башрс
конфиг фиш













echo -e "\e[1;32m
=======================================================
=======================================================
                     Установка YAY
=======================================================
=======================================================
\e[0m"
git clone https://aur.archlinux.org/yay.git
cd yay
makepkg -si
cd

echo -e "\e[1;32m
=======================================================
=======================================================
              Установка FISH и зависимостей
=======================================================
=======================================================
\e[0m"
sudo pacman -S fish pkgfile ttf-dejavu powerline

echo -e "\e[1;32m
=======================================================
=======================================================
              Установка тем и менеджера
=======================================================
=======================================================
\e[0m"
sudo pacman -S nwg-look papirus-icon-theme
git clone https://github.com/vinceliuice/Graphite-gtk-theme
cd Graphite-gtk-theme/
./install.sh
cd
# потом в nwg-look (GTK Settings) выбираем нашу тему и иконки

echo -e "\e[1;32m
=======================================================
=======================================================
              Установка и настройка wlogout
=======================================================
=======================================================
\e[0m"
git clone https://github.com/ArtsyMacaw/wlogout.git
cd wlogout
meson build
ninja -C build
sudo ninja -C build install

echo -e "\e[1;32m
=======================================================
=======================================================
                   Подключение flathub
=======================================================
=======================================================
\e[0m"
flatpak remote-add --if-not-exists flathub https://flathub.org/repo/flathub.flatpakrepo









echo -e "\e[1;32m
=======================================================
=======================================================

                   Последний штрих:
                        долгая
                     ОЧЕНЬ ДОЛГАЯ
                установка Flatpak пакетов

=======================================================
=======================================================
\e[0m"
flatpak install flathub org.telegram.desktop
flatpak install flathub io.github.shiftey.Desktop
flatpak install flathub com.brave.Browser

echo -e "\e[1;32m
=======================================================
=======================================================
         Скрипт завершен, нужно сделать reboot
=======================================================
=======================================================
\e[0m"
